app/Controllers/Filme.php

SELECT *
FROM `filme`
WHERE `filme`.`deleted_at` IS NULL
---
	public function index()
	{
		$dados['titulo'] 	= 	'Creathus :: Filmes';
        $filmes = $this->filmeModel->findAll();

UPDATE `filme` SET `titulo` = 'A Cabana', `sinopse` = 'O filme aborda a questão recorrente da existência do mal através da história de Mackenzie Allen Phillips, um homem que vive sob o peso da experiência de ter sua filha Missy, de seis anos, raptada durante um acampamento de fim de semana. A menina nunca foi encontrada, mas sinais de que ela teria sido violentada e assassinada são achados em uma cabana perdida nas montanhas.\r\n\r\nVivendo desde então sob a \"A Grande Tristeza\", Mack, posteriormente, recebe um misterioso bilhete supostamente escrito por Deus, convidando-o para uma visita a essa mesma cabana. Ali, Mack terá um encontro inusitado com Deus, de quem tentará obter resposta para a inevitável pergunta: \"Se Deus é tão poderoso, por que não faz nada para amenizar nosso sofrimento?\".', `updated_at` = '2022-07-25 10:53:06'
WHERE `filme`.`id_filme` IN ('1')
UPDATE `filme` SET `imagem` = '1.jpg', `updated_at` = '2022-07-25 10:53:06'
WHERE `id_filme` = '1'
---
    public function salvar()
	{

        $img = $this->request->getFile('capa');

        if ($this->filmeModel->save($this->request->getPost())){
            $dados['msg'] = "Filme salvo com sucesso!";
            $id_filme = $this->request->getPost('id_filme');
            echo "oi". $this->filmeModel->getInsertID();

            if ($id_filme != 0){
                $id = $id_filme;
             }

             if ($this->filmeModel->getInsertID() != 0){
                $id = $this->filmeModel->getInsertID();
             }


            $nome = $id.'.jpg';

            $this->filmeModel
                ->where('id_filme', $id)
                ->set(['imagem' => $nome])
                ->update();

UPDATE `filme` SET `deleted_at` = '2022-07-25 22:49:59', `updated_at` = '2022-07-25 22:49:59'
WHERE `id_filme` IN ('dashboard.css')
AND `deleted_at` IS NULL
---
    public function excluir($id){
        if ($this->filmeModel->delete($id)){