app/Controllers/Login.php

SELECT *
FROM `filme`
WHERE `filme`.`deleted_at` IS NULL
ORDER BY `created_at` DESC
 LIMIT 10
SELECT *
FROM `filme`
WHERE `filme`.`deleted_at` IS NULL
ORDER BY `created_at` DESC
 LIMIT 3
---
    public function inicio_usuario()
	{
        $dados['titulo'] 	= 	'Creathus :: Início';


        $filmes = $this->filmeModel
        ->orderBy('created_at', 'desc')
        ->findAll(10);
        $dados['filmes'] = $filmes;

        $destaques = $this->filmeModel
        ->orderBy('created_at', 'desc')
        ->findAll(3);