app/Controllers/Usuario.php

SELECT *
FROM `usuario`
WHERE `usuario`.`deleted_at` IS NULL
---
	public function index()
	{
        $dados['titulo'] 	= 	'Creathus :: Usuários';
        $usuarios = $this->usuarioModel->findAll();